{
  "text": " There is an unspoken of reason why this YouTube channel has been able to take off,  and I have been able to make more and more videos, and an unspoken of reason why I went  from working 80 hours doing multiple jobs, just trying to stay afloat to only need to work with  my T-store. Quality is something I'm average, sure, but only to an extent. If a T is  rooted in a forest and known as a ranch drink it, is it actually delicious? My business would be  nothing without the eyes that see me, which follow with the taste buds that taste my product.  out the eyes that see me, which followed with the taste buds that taste my product.  The reason I was able to take off was thanks to old Nick Brigada.  Old Nick was someone I started watching in 2019.  When the controversy between the big menana, the voice acted of Rolie from Dragon Ball,  and Monica Rial, the voice of Bulma, erupted.  Old Nick was what has been dubbed by a YouTube lawyer, which nowadays kitties are much  different connotations than it did back then.  Why did I continue to watch Old Nick?  I'd rather continue to watch Old Nick because aside from the anime stuff, back then he was smart.  Funny, witty.  He explained a lot in ways that was easy for a simple tinge to understand.  We held many similar values which I must admit, I don't necessarily hold on to anymore,  and he's a prime example as to why.  This is not a political talk so I won't want you to details, but Nick, you are definitely  a prime libertarian and I'm not saying that as a compliment.  Overall, Old Nick seemed like a genuinely good, entertaining guy.  Old Nick seemed like a genuinely good entertaining guy.  Someone whose videos I look forward to every day.  To show my appreciation, I won't send him a box of tea.  I didn't hear anything back, but I expect the debt.  I was a random nobody, sending a random gift.  Then, several months later, I was pleasantly shocked  as he gave me a shout out on his show.  - We had started an earnest in just a second,  but there is something that I haven't done,  and I feel like a jerk for not doing it,  and I feel like a jerk for not doing it because  someone sent me a very, very nice gift,  a while back, and I got it in my kids stole it  and I really want to thank the person who sent it to me,  especially because it's a business  and it's a business that some of you might enjoy.  So this came from the Dragon's Treasure  I'm so sorry for taking so long to do this but I'm glad we had a good audience for that and will probably have a lot of subsequent audience. I wish you the best. I can't wait to drink some of this tea.  My business was minuscule up until that point. I had no idea what was going on with these multiple orders all rolling in around the 11th 30th night until someone left the note with the other saying Brigheda lost sent me.  around the 11th 30th night until someone left the note with the other saying Brigheda Law sent me.  This was April 1st and was an incredible breath of life into my store. Just as the lockdowns  cut off almost all other sources of revenue, the next major event thanks to Old Nick was August 2020,  my fifth year anniversary, where I took a risk on something. I tried to get permission beforehand  but I couldn't get a hold of him but I sent this super chat and got this reaction.  \"Let's do these, let's do these chats here.\"  The Dragon's Treasure says, \"Nick, your last shoutout  \"gave us the best non-convention month ever.\"  Wow, starting August 1st tonight,  we're celebrating our fifth year anniversary,  and we love it if you help us celebrate it.  We were looking to one day be a staple  without bending the knee to the mob  or diddling little kids, which seem  need to the mob or titling little kids which seem to be the standard nowadays. Guys,  give nothing else. Guys, if you have not heard a more based and threatened build a hat  or even than that, it's so interesting. That was fantastic.  There were no contract signings, nothing but my word to him and he allowed it. Naturally,  it. Naturally, for that given every following year, I paid him what I agreed to pay him,  along with bonuses. This blew the store up, and was the first time my store began to rake  in real, living wage money. On that same month, I don't know if this is for a lady or purely  coincidence, but on this channel, my Natura video, and by extension my YouTube channel, blew  up as well. I managed to have a video across 100,000 views before I was even monetized,  and that's something. I would at random times set up more super-chan coupon codes, but I  But at random times, setup Moore's super-chant coupon codes, but I tend to make a joke  with the code more often than not.  Some people find that annoying, and I do get it, but most loved it.  Most of the people in my Discord discovered me through the locator, and he is still probably  with half of my cussle to base originally came from.  Thanks to him, after 2020, I was able to devote more time to the YouTube channel and make  more videos.  Now, Vids that would have taken me over a month to complete, I could get it done in about  a week because I didn't have to work the odd jobs as much anymore.  done in about a week because they didn't have to work their jobs in smudge anymore.  This also allowed me to invent what was essentially new type of advertising, one that  I still used to this day, super chair advertisements.  A $20 silver chair could conduct me as much as over $3,000 in sales, like it did during  the big-step event for both procator and myself.  The next big event happened in November 2021, the Kyle Ritchenhouse Trial.  You're not.  How do you not, how do you not, a quit after that?  Look at bigger.  Look at bigger.  Look at bigger.  Oh, you're a good boy.  Oh, you're a good boy.  Oh, my God.  You're a good boy.  You're a good boy.  You're a good boy.  You're a good boy.  A historic event for this country, Nick Ricciader, who is still old Nick at this point,  pioneered something that downright changed the landscape of this Commodore YouTube.  He livestreamed the entire coach trial, bringing on other lawyers to discuss the case  He livestreamed the entire court trial, bringing on other lawyers to discuss the case  in real time, give dead legal opinions and insights, and do so in a way that the lane  man can understand.  He didn't set out to do anything special, but he more than likely helped shape the trial  itself, and at its peak had over 100,000 people watching.  That is massive.  Mine blowingly massive.  He got you going to Timcast IRL, spoke for Glenn Beck, made all the media rounds, and  I was truly happy for him.  made all the media rounds and I was truly happy for him. I initially didn't want  to do any coupon code during this time, as I felt there will be two in  appropriate, but several folks convinced me otherwise. I located with him  beforehand and thanks to proper timing, I created now famous coupon code that  is still a mission to be to this day, four doors more horse. But speaking of  super chats, the Dragon's Treasure says YouTube is censoring a real message,  YouTube is censoring real message, text sent to Twitter DM, feel free to read when you  deem appropriate.  Well, I know that Dragon's Treasure will never send an appropriate super chat, but let  me read it real quick here.  He says, \"Hello humble anime themed teapeddler here.  Been a sporter, Mr. Raketa for a few years.  Oh, I see why they wouldn't accept this as long for a few years now, and he has treated  For a few years now and he has treated me too kind is given good graces to let me grift during his historic event  I make it sell anime themed loose leaf teas and tea accessories  Bouch by me Nick himself for being good and maybe by some people on the current panel  Visit the dragons treasure dot com and use the appropriate coupon code  Four doors more hoars on the website to get 10% off your next order  10% off your next order.  - And Bart, every sale will be fed back to the Riccada family.  - He also has a--  - He also has a--  - He has an end to help him here.  - But he can all honesty,  and all honesty, the dragon's treasure,  he does have very good tea.  Does he not hurt?  Can't see.  - Yes, he does have some wonderful tea  and some wonderful flavors.  For example, this one, Phoenix Ash,  wonderful tea and some wonderful flavors. For example, this one, Phoenix Ash or this one.  That's also wonderful. Earl Gray, Teeth with vanilla cream. That's been very exciting in my life.  I like you, Link, sir. You can go.  It's actually, it's very good tea. And he did ask if he could send a super chat and I said,  \"Of course you can,\" because... I wasn't an adventurer like you until I was shot in the knee.  a shot in the knee.  I had to cut the clip short because they weren't time for several minutes about my  tea and things relating to it.  That month was a de-most successful month I have ever had, where I made almost as much  in that month as I did in all of 2019.  It was the month where I stopped driving for Uber and Lyft, and almost a month where I stopped  renting out my apartment to Airbnb.  But I had one more guest after that that's allowed by me never doing it again, but that  story is irrelevant here.  but that story is irrelevant here. I could finally put all my focus into the business and the YouTube  channel and boy that I make both of those grow. It was an all easy but a lot of me to upgrade my  business in the background so I could make incomplete orders much faster. It helped me finally move  out of Illinois and down to Texas four to five months later. Both of these moments, the 50-day  anniversary coupon and the written house coupon put me on the map. Other trial events such as the  the Johnny Dept trial kept my momentum going and it was a strong momentum that I rode  until April 2023 where finally Biden's economy became too much for everyone.  I had also met Ol' Nick in person during enemy Matsuri where I again thanked him for everything  he had done for me.  And regardless of what I say lay it in this video, all of this is true and will always  remain true.  I don't know where I would be without what Ol' Nick did for me.  With the immeasurable stress that was going out in my life from 2018 until that trial  was stressed I was going out in my life from 2018 until that trial.  When I began my 80 hour workdays, gaining 100 pounds in a single year after leaving my  personal training job and stopping all physical activity whatsoever.  Just so I could sit in front of a computer to order inside of a car, my body became a broken  wreck.  And all of it seemingly for nothing, barely even surviving.  Without old Nick finally shining a light so others can see me, it is a very possible  that I would be lying in a casket underground with an extra bird shaped hole in my skull.  that I would be lying in a casket underground with an extra bullet-shaped hole in my skull,  as it heads up.  The middle portion of this video will have little to no visual edits.  It's not as pretty much I can do, so you only really need to listen.  I'll let you know when I start doing video edits again.  Of course you probably noticed that up until now I've been using a term \"old\" nick.  Because at some point Nick Riccada of yesterday changed into the necrocada of today.  Many speculate on when the change happened.  speculate on when the change happened.  When did we switch from the volcano law to locate a law she put in?  I personally believe, as to many others, it was when he came back from a vacation after  the John Yiddep trial.  It was clear to something about that trial, combined with unknown going down in his  personal life, really did a number on him.  It drained him.  So he went on a much deserved, much notification.  When he came back, he did it seem different.  I thought it was a good difference in fact, but slowly but surely everyone began to  But slowly but surely everyone began to hear the changes not only in the shows but to Nick.  Certain moral principles he held onto he no longer believed in.  I think the most prominent example is when in the past he would say that he should never  post any new zanir internet.  Never show your ankles and chin in the same picture.  Things along those lines and then he goes and posts a picture with the whiskey bottle in his  butt.  The Johnny Depp stream brought with it a whole host of wine moms, a completely different  moms. A completely different audience than what he was used to. There was a lot of butt  posting and flashing going on on locals that he, a midi man who would have been opposed  to them doing this in the past, but now he encouraged it. And even joined in, along  with his wife. No, I'm not going to show Lady Wackett's butt cheeks. A sentence I would  never have thought possible at one point. There was also the kid that did in a chat  named Mandy, which Rakeda had multiple drunken occasions to talk about how he would totally  years. His discord became a raging dumpster fire, one which I decided to leave before he ended  up nooking it, because he had no care or desire to maintain it. The alcoholism became overwhelming,  whereas in the past you catch on rare occasion being so drunk he began to slow his words,  it became the norm on his show. The amounts of broken promises became a running meme.  I'll bring back the chat dad's stream, I'll bring back the big brain panel, I'll do the 24  24 hours, I'll do this, I'll do that.  At this point, the meme became, if Rakeda said he was gonna do something, you know that  something was not gonna get done.  He, the YouTube lawyer, stopped talking about legal topics, and instead began to talk about  things that no one in his old audience wanted to hear him talk about, but the new white  mom certainly did, he would talk about disturbing sex toys, most infamously deballed though.  Banging his wife in various ways, including with the ball though, or in a sex swing, and  ways including with the Baldo or in a sex swing and let me be cleared he would seriously  just go on and on and on and on and on again about banging his wife if it wasn't about  the sex swing or the Baldo or whatever else it would be non-stop relationship advice much of  which came off as disconnected boomer talk even the off-the-cuff ramblings that he used to do which  I myself loved became less and less interesting until they became more than more boring or even  unless interesting. Until they became more than more boring or even just annoying.  It was like his quick wits began to fail with each passing night along with his liver.  Eventually, I found myself questioning why am I listening anymore? Nothing could interest me anymore.  In fact, it often disgusts me, but I could not forget what he did for me, so I stuck it out for  as long as I could. I tried defending Meg, who had began to turn into the very low cow he used to  make fun of, but he kept going down the drain. Why I think this happened, a combination of his  down the drain. Why I think this happened? A combination of his poor time management of the  Bridget House and Dept Trials that broke him mentally and physically combined with a mind-blowing  success he suddenly gained. Along with the Rumble exclusive contracts, dude must have been making  seven figures at this point, but because of all this, he became apathetic, pathologic,  and overall corrupted. I went from listening to every show he did.  Janelle maybe one or two a week if it looked like he was actually going to talk about something  if it looked like he was actually going to talk about something log related or cultural related.  I still did the coupon codes, but while it was still a good amount coming in, the amount  I was getting was notably less with each passing month.  And so he continued to alienate and even insult his previous fanbase, which included a lot  of anime weeps, because the big trout was one of their three major events of the channel  that helped blow him up.  Channels like legal vices or stuff the alternate that were about 20% of his size at the time  were bringing in more numbers.  I don't know.  Wait, are they talking about a specific thing?  I don't know, apparently, apparently you're having sex with a bunch of married women.  Oh yeah, so, um...  Head to V-Tuber, Pipkin Pippa on his show.  Someone Nick previously wanted on a show, but her boss said no.  Many people to cry, such as choice initially.  Old Nick and Pipkin Pippa would have made for an amazing show, but now we understand  that a little bit better.  Anyway, Koomla Lot is one of those people who would do anything for the good rift.  anything for the good rift. He will tell you that totally ironic but not ironic tone of  voice that that side of YouTube always does that everything is just purely for the money.  Nothing else matters. V2 was bringing a lot of views and cash, so after the interview  he had to run to deal with what he could to keep getting her attention. Finally, he did  something across the line. He posted a pic of someone else claiming it was Pippa and she  was over at his house for many reasons. Even joking about exposing a V2's identity is  Even joking about exposing a VTU's identity is strictly taboo, more so than any other industry I found.  It would have been all well and good if Kuma allowed to apologize like a normal person, but there's no griften death.  So he insulted her entire company in a fake apology.  Rakeet had some not nice things to say as well on a livestream.  I am any other than I'd like what he had to say, but whatever.  The manless team like it was done.  On a Friday night, I can't remember if it was the same week as the Kuma lot Pippa event,  same week as the Kumblaut Pippa event, or if it was the next week, but sometime had  passed since then.  Not one, but two massive impactful Supreme Court rulings dropped on that day.  I wanted to know more about what were the ramifications of these events.  Nick had a show on that night.  The title of the show was about the rulings.  He listed some other lawyers that will be on to talk about it.  I was happy and excited.  This is what made me fall in love with Nick's dreams.  Next morning, I put the show on and to my surprise, Kumblaut is on.  and to my surprise, Kuma lot is on. For over an hour, with the other disinterested lawyers  no less, Rakeda and Kuma lot to talk non-stalk about Pippa, Phase Connect, and V2 is as a whole,  including the fanbase. They would insulting and degrading the entire time. Nick does something  he's become infamous for at this point. He says talking about his butts about things he does  not know anything about, like V2 with contracts and companies, and all the behind-the-scenes dealings,  and all the behind-the-scenes dealings, but he pretends that he's been expert on it.  Finally, after an hour to insults, someone tries to get the topic onto the between-cold  drawings.  Nick barely over half a sentence on them, and moves on.  That's it.  Two landmark decisions, and he instead decides to do the thing.  He totally hates doing guys, and the thing he somehow always wrapped up in, even though  he tries to also her to avoid drama.  It wasn't like he was just making some funny jabs at the beat-u-warts.  It wasn't like he was just making some funny jabs at the B2 Earth.  I mean he was really digging into the community.  To that point on, I decided that's it.  The ramp at alcoholism, the constant nonstop discomforting sex talk, the insults.  This was not the same man a two years ago, little on four, not by a long shot.  I decided to quietly cut my ties, no longer support, no longer do coupon codes.  Let's make no mistake.  Even though his sales were drying up to less than half of what they once were, that was  Even though his sales were drying up to less than half of what they once were, that was  still tens of thousands of dollars every year that I had just walked away from.  At this point in 2023, things should have crashed in economy.  My income was already down by almost 50% compared to the start of the year.  So me walking away from all that money on a modal imprinsible stance financially it hurt.  If you want to help me ease that pain a little bit, check out the website I keep going  on about.  a little bit, check out the website I keep going on about.  The dragon's treasure is linked down below.  If you support someone who chose principles over money in a time when he really needed  that money, let me see it, cause boy do I feel all that loss of revenue.  Over 100 T's, we all shaft coffee, and now soaps, handmade by yours truly.  Unlike the aforementioned people, I'm not gonna call this a grift, because I actually  do love what I do.  I don't have contempt for my code audience.  If I had a billion dollars, I would not retire.  I would still want you to run this company and the spirit of what I'm doing is more important  than the money, as I painfully showcased last summer.  So buy some teacher help support me and get me through this economy and let's get back to the plot,  what I will return with making actual edits.  Have things gotten better with Nick?  God no.  I haven't been hate watching Nick as some of his former fans have, but clips would occasionally come by my timeline.  Would people would send me things?  my timeline. Would people would send me things? Had one point I actually had to tell somebody  stopped sending me these things. So again I'm almost done a daily basis. He has continued  alien age not only his fans but former friends. They're very few YouTubers out there and I will still  talk to. I know people are like no one associates are Kata. Giants I stopped associated with so  many people and why? Because they're dishonest. He became low cow of the year in 2023 on  'cause they're dishonest.  He became low cow of the year in 2023 on Keywood Farms  because of the Star Wars Bible.  He decided to team up with people like Juju the cow,  also known as Dick Masterson, and Bido,  a man who was going to uncomfortable lengths  defending the movie Cuties,  and befitting to those who go after children as we.  These men proved that you don't need talent, skill,  or it looks to be successful.  Just hate, fart, and domicart, and pay pigs will follow.  He's gone after the YouTube when a comic  would create an adochilite repeatedly.  follow. He's gone after YouTube when a comic book created an adochil I repeatedly, non-stop,  in many drunken bands. Over essentially nothing. I've never given a dime to Eric, so I don't  really have a reason to be on his side, but the amount Nick, Juju and Vito have gone after this man's  business is astounding and is enough to piss off anybody at this point. The way we became  and decided to start defending the movie cuties, I covered this yesterday on my livestream,  live stream and we watch the trailer and I determined that basically everyone  involved should get the gas. Like you said, there could be a daring and brave  decision to do something and it can still be unacceptable and it can still be  exploitative and it can still put children at risk and one of the key reasons  that child porn is banned is not just the damage done to the children who's a  is banned is not just the damage done  to the children who's a victim of the particular photography.  It's the idea that creating the market  around the exploited children exposes more children  to exploitation and children are particularly vulnerable  and unable to protect themselves.  A lot of people should on veto  for his staunch defense of cuties also.  The right-through thing is weird, but I guess I need to see the context.  Rakeda has finally, with no more bridge left with me, being left on red, has gone through  and finally committed to the stick, and he is now firmly on team, Juju the cow, team  Christopher goes all to the pedophile, and he's now defending cuties as an artistic expression,  Predesizing the sexual exploitation of children by sexually exploiting children.  By having crotch shots on 11 year olds in Leotards, they are making a point about Hollywood or some shit.  An even grave desecration, but for the signs of his decline, this video's length is already much longer than 9/10 of it to be.  I was going to go into even more detail.  Show more videos about drunken Nick, showcasing more hypocrisy, talking about specific events, like how he drunkenly attacked the trust of a man.  hypocrisy. Talking about specific events like how he drunkenly attacked the trust of a man  who reached out to him because he wanted to off himself but many videos have been done on this  already. In the point of all this, believe it or not, is not to bash Nick. What sparked this is what  happened on his stream on Tuesday, May 20th, where Nick became... whatever this is.  Why would you do this? Why now?  down about you probably doesn't mean anything so maybe hitting it from someone who owes  so much to you? Well you need help. You are not in a good space at all. You are an alcoholic  and a bad one at that. I don't know what you're taking but you're taking some kind of a drug.  I heard about how you decided to take January off from drinking but you decided to change that  until you'll take January off from drinking on stream. I don't even know if you hold on to even that.  You are missing what shows that you're making which I am sure it goes against your contract.  than you're making, which I am sure it goes against your contract.  You're weird over the top lies, like your 107 degree temperature or whatever you claim  to have, but getting worse and worse, I don't know what else it will take for you to  realize this, but you more than likely do need to go to rehab.  And afterwards, you're going to have to make a lot of apologies to a lot of people.  No, not any woke mob, and not to people who only want to see your downfall, your friends,  your family, your audience.  your family, your audience. The ones who still cared about you. I want you to once again  be a man I could happily say that I support. Not someone that I have to apologize and  make excuses for that I used to support. You were a good family man and even though I'm  not a Christian I still abuse you as one of the best examples of a man with a strong  Christian base. This is not the style of content I normally make.  If you expect one of these drama videos there's no point in subscribing. To any  There's no point in subscribing.  To any former fan to find me after so much time, well, hello I guess.  Check out the links in some of my videos to see if the content I normally make is something  up at the alley.  And once again, to Nick.  Find some help or at some point you will cross a line in which no apology will work on  anyone else again.",
  "segments": [
    {
      "start": 0,
      "end": 4.48,
      "text": " There is an unspoken of reason why this YouTube channel has been able to take off,"
    },
    {
      "start": 4.48,
      "end": 8.8,
      "text": " and I have been able to make more and more videos, and an unspoken of reason why I went"
    },
    {
      "start": 8.8,
      "end": 14.08,
      "text": " from working 80 hours doing multiple jobs, just trying to stay afloat to only need to work with"
    },
    {
      "start": 14.08,
      "end": 19.04,
      "text": " my T-store. Quality is something I'm average, sure, but only to an extent. If a T is"
    },
    {
      "start": 19.04,
      "end": 24.16,
      "text": " rooted in a forest and known as a ranch drink it, is it actually delicious? My business would be"
    },
    {
      "start": 24.16,
      "end": 29.2,
      "text": " nothing without the eyes that see me, which follow with the taste buds that taste my product."
    },
    {
      "start": 25,
      "end": 29.4,
      "text": " out the eyes that see me, which followed with the taste buds that taste my product."
    },
    {
      "start": 29.4,
      "end": 34.04,
      "text": " The reason I was able to take off was thanks to old Nick Brigada."
    },
    {
      "start": 34.04,
      "end": 36.84,
      "text": " Old Nick was someone I started watching in 2019."
    },
    {
      "start": 36.84,
      "end": 40.88,
      "text": " When the controversy between the big menana, the voice acted of Rolie from Dragon Ball,"
    },
    {
      "start": 40.88,
      "end": 43.64,
      "text": " and Monica Rial, the voice of Bulma, erupted."
    },
    {
      "start": 43.64,
      "end": 47.6,
      "text": " Old Nick was what has been dubbed by a YouTube lawyer, which nowadays kitties are much"
    },
    {
      "start": 47.6,
      "end": 50,
      "text": " different connotations than it did back then."
    },
    {
      "start": 50,
      "end": 52.239999999999995,
      "text": " Why did I continue to watch Old Nick?"
    },
    {
      "start": 50,
      "end": 55.6,
      "text": " I'd rather continue to watch Old Nick because aside from the anime stuff, back then he was smart."
    },
    {
      "start": 55.6,
      "end": 56.92,
      "text": " Funny, witty."
    },
    {
      "start": 56.92,
      "end": 60.56,
      "text": " He explained a lot in ways that was easy for a simple tinge to understand."
    },
    {
      "start": 60.56,
      "end": 65.6,
      "text": " We held many similar values which I must admit, I don't necessarily hold on to anymore,"
    },
    {
      "start": 65.6,
      "end": 67.32,
      "text": " and he's a prime example as to why."
    },
    {
      "start": 67.32,
      "end": 71.16,
      "text": " This is not a political talk so I won't want you to details, but Nick, you are definitely"
    },
    {
      "start": 71.16,
      "end": 74.44,
      "text": " a prime libertarian and I'm not saying that as a compliment."
    },
    {
      "start": 74.44,
      "end": 78.76,
      "text": " Overall, Old Nick seemed like a genuinely good, entertaining guy."
    },
    {
      "start": 75,
      "end": 78.52,
      "text": " Old Nick seemed like a genuinely good entertaining guy."
    },
    {
      "start": 78.52,
      "end": 81.12,
      "text": " Someone whose videos I look forward to every day."
    },
    {
      "start": 81.12,
      "end": 84.24,
      "text": " To show my appreciation, I won't send him a box of tea."
    },
    {
      "start": 84.24,
      "end": 86.56,
      "text": " I didn't hear anything back, but I expect the debt."
    },
    {
      "start": 86.56,
      "end": 88.96000000000001,
      "text": " I was a random nobody, sending a random gift."
    },
    {
      "start": 88.96000000000001,
      "end": 92.24,
      "text": " Then, several months later, I was pleasantly shocked"
    },
    {
      "start": 92.24,
      "end": 94.68,
      "text": " as he gave me a shout out on his show."
    },
    {
      "start": 94.68,
      "end": 96.24,
      "text": " - We had started an earnest in just a second,"
    },
    {
      "start": 96.24,
      "end": 100.68,
      "text": " but there is something that I haven't done,"
    },
    {
      "start": 100.68,
      "end": 103.36,
      "text": " and I feel like a jerk for not doing it,"
    },
    {
      "start": 100,
      "end": 103.72,
      "text": " and I feel like a jerk for not doing it because"
    },
    {
      "start": 105.72,
      "end": 109.32,
      "text": " someone sent me a very, very nice gift,"
    },
    {
      "start": 109.32,
      "end": 114.32,
      "text": " a while back, and I got it in my kids stole it"
    },
    {
      "start": 114.32,
      "end": 117.12,
      "text": " and I really want to thank the person who sent it to me,"
    },
    {
      "start": 117.12,
      "end": 119.88,
      "text": " especially because it's a business"
    },
    {
      "start": 119.88,
      "end": 122.72,
      "text": " and it's a business that some of you might enjoy."
    },
    {
      "start": 122.72,
      "end": 126.44,
      "text": " So this came from the Dragon's Treasure"
    },
    {
      "start": 150,
      "end": 168,
      "text": " I'm so sorry for taking so long to do this but I'm glad we had a good audience for that and will probably have a lot of subsequent audience. I wish you the best. I can't wait to drink some of this tea."
    },
    {
      "start": 168,
      "end": 179,
      "text": " My business was minuscule up until that point. I had no idea what was going on with these multiple orders all rolling in around the 11th 30th night until someone left the note with the other saying Brigheda lost sent me."
    },
    {
      "start": 175,
      "end": 179.88,
      "text": " around the 11th 30th night until someone left the note with the other saying Brigheda Law sent me."
    },
    {
      "start": 179.88,
      "end": 185.32,
      "text": " This was April 1st and was an incredible breath of life into my store. Just as the lockdowns"
    },
    {
      "start": 185.32,
      "end": 190.84,
      "text": " cut off almost all other sources of revenue, the next major event thanks to Old Nick was August 2020,"
    },
    {
      "start": 190.84,
      "end": 195.56,
      "text": " my fifth year anniversary, where I took a risk on something. I tried to get permission beforehand"
    },
    {
      "start": 195.56,
      "end": 199.96,
      "text": " but I couldn't get a hold of him but I sent this super chat and got this reaction."
    },
    {
      "start": 200,
      "end": 203.24,
      "text": " \"Let's do these, let's do these chats here.\""
    },
    {
      "start": 203.24,
      "end": 207.44,
      "text": " The Dragon's Treasure says, \"Nick, your last shoutout"
    },
    {
      "start": 207.44,
      "end": 211.64,
      "text": " \"gave us the best non-convention month ever.\""
    },
    {
      "start": 211.64,
      "end": 215.56,
      "text": " Wow, starting August 1st tonight,"
    },
    {
      "start": 215.56,
      "end": 218.16,
      "text": " we're celebrating our fifth year anniversary,"
    },
    {
      "start": 218.16,
      "end": 220.76,
      "text": " and we love it if you help us celebrate it."
    },
    {
      "start": 220.76,
      "end": 223.88,
      "text": " We were looking to one day be a staple"
    },
    {
      "start": 223.88,
      "end": 226.16,
      "text": " without bending the knee to the mob"
    },
    {
      "start": 226.16,
      "end": 228.2,
      "text": " or diddling little kids, which seem"
    },
    {
      "start": 225,
      "end": 232,
      "text": " need to the mob or titling little kids which seem to be the standard nowadays. Guys,"
    },
    {
      "start": 232,
      "end": 239.52,
      "text": " give nothing else. Guys, if you have not heard a more based and threatened build a hat"
    },
    {
      "start": 239.52,
      "end": 246.04,
      "text": " or even than that, it's so interesting. That was fantastic."
    },
    {
      "start": 246.04,
      "end": 251.52,
      "text": " There were no contract signings, nothing but my word to him and he allowed it. Naturally,"
    },
    {
      "start": 250,
      "end": 254.88,
      "text": " it. Naturally, for that given every following year, I paid him what I agreed to pay him,"
    },
    {
      "start": 254.88,
      "end": 259.36,
      "text": " along with bonuses. This blew the store up, and was the first time my store began to rake"
    },
    {
      "start": 259.36,
      "end": 264.16,
      "text": " in real, living wage money. On that same month, I don't know if this is for a lady or purely"
    },
    {
      "start": 264.16,
      "end": 269.12,
      "text": " coincidence, but on this channel, my Natura video, and by extension my YouTube channel, blew"
    },
    {
      "start": 269.12,
      "end": 273.76,
      "text": " up as well. I managed to have a video across 100,000 views before I was even monetized,"
    },
    {
      "start": 273.76,
      "end": 278.24,
      "text": " and that's something. I would at random times set up more super-chan coupon codes, but I"
    },
    {
      "start": 275,
      "end": 279.24,
      "text": " But at random times, setup Moore's super-chant coupon codes, but I tend to make a joke"
    },
    {
      "start": 279.24,
      "end": 281.12,
      "text": " with the code more often than not."
    },
    {
      "start": 281.12,
      "end": 284.6,
      "text": " Some people find that annoying, and I do get it, but most loved it."
    },
    {
      "start": 284.6,
      "end": 288.3,
      "text": " Most of the people in my Discord discovered me through the locator, and he is still probably"
    },
    {
      "start": 288.3,
      "end": 291.36,
      "text": " with half of my cussle to base originally came from."
    },
    {
      "start": 291.36,
      "end": 295.88,
      "text": " Thanks to him, after 2020, I was able to devote more time to the YouTube channel and make"
    },
    {
      "start": 295.88,
      "end": 296.88,
      "text": " more videos."
    },
    {
      "start": 296.88,
      "end": 300.68,
      "text": " Now, Vids that would have taken me over a month to complete, I could get it done in about"
    },
    {
      "start": 300.68,
      "end": 303.92,
      "text": " a week because I didn't have to work the odd jobs as much anymore."
    },
    {
      "start": 300,
      "end": 303.84,
      "text": " done in about a week because they didn't have to work their jobs in smudge anymore."
    },
    {
      "start": 303.84,
      "end": 307.56,
      "text": " This also allowed me to invent what was essentially new type of advertising, one that"
    },
    {
      "start": 307.56,
      "end": 310.16,
      "text": " I still used to this day, super chair advertisements."
    },
    {
      "start": 310.16,
      "end": 315.44,
      "text": " A $20 silver chair could conduct me as much as over $3,000 in sales, like it did during"
    },
    {
      "start": 315.44,
      "end": 318.36,
      "text": " the big-step event for both procator and myself."
    },
    {
      "start": 318.36,
      "end": 323,
      "text": " The next big event happened in November 2021, the Kyle Ritchenhouse Trial."
    },
    {
      "start": 350,
      "end": 351,
      "text": " You're not."
    },
    {
      "start": 351,
      "end": 357,
      "text": " How do you not, how do you not, a quit after that?"
    },
    {
      "start": 357,
      "end": 358,
      "text": " Look at bigger."
    },
    {
      "start": 358,
      "end": 359,
      "text": " Look at bigger."
    },
    {
      "start": 359,
      "end": 360,
      "text": " Look at bigger."
    },
    {
      "start": 360,
      "end": 361,
      "text": " Oh, you're a good boy."
    },
    {
      "start": 361,
      "end": 362,
      "text": " Oh, you're a good boy."
    },
    {
      "start": 362,
      "end": 363,
      "text": " Oh, my God."
    },
    {
      "start": 363,
      "end": 364,
      "text": " You're a good boy."
    },
    {
      "start": 364,
      "end": 365,
      "text": " You're a good boy."
    },
    {
      "start": 365,
      "end": 366,
      "text": " You're a good boy."
    },
    {
      "start": 366,
      "end": 367,
      "text": " You're a good boy."
    },
    {
      "start": 367,
      "end": 371.48,
      "text": " A historic event for this country, Nick Ricciader, who is still old Nick at this point,"
    },
    {
      "start": 371.48,
      "end": 375.32,
      "text": " pioneered something that downright changed the landscape of this Commodore YouTube."
    },
    {
      "start": 375.32,
      "end": 379.52,
      "text": " He livestreamed the entire coach trial, bringing on other lawyers to discuss the case"
    },
    {
      "start": 375,
      "end": 379.56,
      "text": " He livestreamed the entire court trial, bringing on other lawyers to discuss the case"
    },
    {
      "start": 379.56,
      "end": 384,
      "text": " in real time, give dead legal opinions and insights, and do so in a way that the lane"
    },
    {
      "start": 384,
      "end": 385.4,
      "text": " man can understand."
    },
    {
      "start": 385.4,
      "end": 389.24,
      "text": " He didn't set out to do anything special, but he more than likely helped shape the trial"
    },
    {
      "start": 389.24,
      "end": 394.04,
      "text": " itself, and at its peak had over 100,000 people watching."
    },
    {
      "start": 394.04,
      "end": 395.76,
      "text": " That is massive."
    },
    {
      "start": 395.76,
      "end": 397.28,
      "text": " Mine blowingly massive."
    },
    {
      "start": 397.28,
      "end": 401.92,
      "text": " He got you going to Timcast IRL, spoke for Glenn Beck, made all the media rounds, and"
    },
    {
      "start": 401.92,
      "end": 403.36,
      "text": " I was truly happy for him."
    },
    {
      "start": 400,
      "end": 404.28,
      "text": " made all the media rounds and I was truly happy for him. I initially didn't want"
    },
    {
      "start": 404.28,
      "end": 407.32,
      "text": " to do any coupon code during this time, as I felt there will be two in"
    },
    {
      "start": 407.32,
      "end": 410.84,
      "text": " appropriate, but several folks convinced me otherwise. I located with him"
    },
    {
      "start": 410.84,
      "end": 415.4,
      "text": " beforehand and thanks to proper timing, I created now famous coupon code that"
    },
    {
      "start": 415.4,
      "end": 420.48,
      "text": " is still a mission to be to this day, four doors more horse. But speaking of"
    },
    {
      "start": 420.48,
      "end": 427,
      "text": " super chats, the Dragon's Treasure says YouTube is censoring a real message,"
    },
    {
      "start": 425,
      "end": 431.32,
      "text": " YouTube is censoring real message, text sent to Twitter DM, feel free to read when you"
    },
    {
      "start": 431.32,
      "end": 432.32,
      "text": " deem appropriate."
    },
    {
      "start": 432.32,
      "end": 437.72,
      "text": " Well, I know that Dragon's Treasure will never send an appropriate super chat, but let"
    },
    {
      "start": 437.72,
      "end": 440.28,
      "text": " me read it real quick here."
    },
    {
      "start": 440.28,
      "end": 444.44,
      "text": " He says, \"Hello humble anime themed teapeddler here."
    },
    {
      "start": 444.44,
      "end": 446.6,
      "text": " Been a sporter, Mr. Raketa for a few years."
    },
    {
      "start": 446.6,
      "end": 452.04,
      "text": " Oh, I see why they wouldn't accept this as long for a few years now, and he has treated"
    },
    {
      "start": 450,
      "end": 456.56,
      "text": " For a few years now and he has treated me too kind is given good graces to let me grift during his historic event"
    },
    {
      "start": 456.56,
      "end": 460.4,
      "text": " I make it sell anime themed loose leaf teas and tea accessories"
    },
    {
      "start": 460.72,
      "end": 465.92,
      "text": " Bouch by me Nick himself for being good and maybe by some people on the current panel"
    },
    {
      "start": 465.92,
      "end": 471.14,
      "text": " Visit the dragons treasure dot com and use the appropriate coupon code"
    },
    {
      "start": 471.64,
      "end": 477.4,
      "text": " Four doors more hoars on the website to get 10% off your next order"
    },
    {
      "start": 475,
      "end": 477.64,
      "text": " 10% off your next order."
    },
    {
      "start": 478.84,
      "end": 483.84,
      "text": " - And Bart, every sale will be fed back to the Riccada family."
    },
    {
      "start": 483.84,
      "end": 485.16,
      "text": " - He also has a--"
    },
    {
      "start": 485.16,
      "end": 486,
      "text": " - He also has a--"
    },
    {
      "start": 486,
      "end": 489.32,
      "text": " - He has an end to help him here."
    },
    {
      "start": 490.86,
      "end": 492.88,
      "text": " - But he can all honesty,"
    },
    {
      "start": 492.88,
      "end": 494.56,
      "text": " and all honesty, the dragon's treasure,"
    },
    {
      "start": 494.56,
      "end": 497.04,
      "text": " he does have very good tea."
    },
    {
      "start": 497.04,
      "end": 498.4,
      "text": " Does he not hurt?"
    },
    {
      "start": 498.4,
      "end": 499.24,
      "text": " Can't see."
    },
    {
      "start": 499.24,
      "end": 500.52,
      "text": " - Yes, he does have some wonderful tea"
    },
    {
      "start": 500.52,
      "end": 501.64,
      "text": " and some wonderful flavors."
    },
    {
      "start": 501.64,
      "end": 504.8,
      "text": " For example, this one, Phoenix Ash,"
    },
    {
      "start": 500,
      "end": 505.44,
      "text": " wonderful tea and some wonderful flavors. For example, this one, Phoenix Ash or this one."
    },
    {
      "start": 506.8,
      "end": 511.68,
      "text": " That's also wonderful. Earl Gray, Teeth with vanilla cream. That's been very exciting in my life."
    },
    {
      "start": 511.68,
      "end": 513.76,
      "text": " I like you, Link, sir. You can go."
    },
    {
      "start": 515.52,
      "end": 522,
      "text": " It's actually, it's very good tea. And he did ask if he could send a super chat and I said,"
    },
    {
      "start": 522,
      "end": 525.84,
      "text": " \"Of course you can,\" because... I wasn't an adventurer like you until I was shot in the knee."
    },
    {
      "start": 525,
      "end": 528.48,
      "text": " a shot in the knee."
    },
    {
      "start": 528.48,
      "end": 531.64,
      "text": " I had to cut the clip short because they weren't time for several minutes about my"
    },
    {
      "start": 531.64,
      "end": 533.36,
      "text": " tea and things relating to it."
    },
    {
      "start": 533.36,
      "end": 538.08,
      "text": " That month was a de-most successful month I have ever had, where I made almost as much"
    },
    {
      "start": 538.08,
      "end": 541.12,
      "text": " in that month as I did in all of 2019."
    },
    {
      "start": 541.12,
      "end": 545.04,
      "text": " It was the month where I stopped driving for Uber and Lyft, and almost a month where I stopped"
    },
    {
      "start": 545.04,
      "end": 547.04,
      "text": " renting out my apartment to Airbnb."
    },
    {
      "start": 547.04,
      "end": 550.48,
      "text": " But I had one more guest after that that's allowed by me never doing it again, but that"
    },
    {
      "start": 550.48,
      "end": 551.76,
      "text": " story is irrelevant here."
    },
    {
      "start": 550,
      "end": 555.2,
      "text": " but that story is irrelevant here. I could finally put all my focus into the business and the YouTube"
    },
    {
      "start": 555.2,
      "end": 560.08,
      "text": " channel and boy that I make both of those grow. It was an all easy but a lot of me to upgrade my"
    },
    {
      "start": 560.08,
      "end": 565.12,
      "text": " business in the background so I could make incomplete orders much faster. It helped me finally move"
    },
    {
      "start": 565.12,
      "end": 569.84,
      "text": " out of Illinois and down to Texas four to five months later. Both of these moments, the 50-day"
    },
    {
      "start": 569.84,
      "end": 575.04,
      "text": " anniversary coupon and the written house coupon put me on the map. Other trial events such as the"
    },
    {
      "start": 575,
      "end": 579.56,
      "text": " the Johnny Dept trial kept my momentum going and it was a strong momentum that I rode"
    },
    {
      "start": 579.56,
      "end": 584.76,
      "text": " until April 2023 where finally Biden's economy became too much for everyone."
    },
    {
      "start": 584.76,
      "end": 589.64,
      "text": " I had also met Ol' Nick in person during enemy Matsuri where I again thanked him for everything"
    },
    {
      "start": 589.64,
      "end": 590.64,
      "text": " he had done for me."
    },
    {
      "start": 590.64,
      "end": 594.84,
      "text": " And regardless of what I say lay it in this video, all of this is true and will always"
    },
    {
      "start": 594.84,
      "end": 595.84,
      "text": " remain true."
    },
    {
      "start": 595.84,
      "end": 599.16,
      "text": " I don't know where I would be without what Ol' Nick did for me."
    },
    {
      "start": 599.16,
      "end": 603.52,
      "text": " With the immeasurable stress that was going out in my life from 2018 until that trial"
    },
    {
      "start": 600,
      "end": 603.64,
      "text": " was stressed I was going out in my life from 2018 until that trial."
    },
    {
      "start": 603.64,
      "end": 608.18,
      "text": " When I began my 80 hour workdays, gaining 100 pounds in a single year after leaving my"
    },
    {
      "start": 608.18,
      "end": 612.4,
      "text": " personal training job and stopping all physical activity whatsoever."
    },
    {
      "start": 612.4,
      "end": 616.4,
      "text": " Just so I could sit in front of a computer to order inside of a car, my body became a broken"
    },
    {
      "start": 616.4,
      "end": 617.4,
      "text": " wreck."
    },
    {
      "start": 617.4,
      "end": 620.76,
      "text": " And all of it seemingly for nothing, barely even surviving."
    },
    {
      "start": 620.76,
      "end": 625.08,
      "text": " Without old Nick finally shining a light so others can see me, it is a very possible"
    },
    {
      "start": 625.08,
      "end": 629.96,
      "text": " that I would be lying in a casket underground with an extra bird shaped hole in my skull."
    },
    {
      "start": 625,
      "end": 629.88,
      "text": " that I would be lying in a casket underground with an extra bullet-shaped hole in my skull,"
    },
    {
      "start": 629.88,
      "end": 630.88,
      "text": " as it heads up."
    },
    {
      "start": 630.88,
      "end": 633.92,
      "text": " The middle portion of this video will have little to no visual edits."
    },
    {
      "start": 633.92,
      "end": 637.24,
      "text": " It's not as pretty much I can do, so you only really need to listen."
    },
    {
      "start": 637.24,
      "end": 640,
      "text": " I'll let you know when I start doing video edits again."
    },
    {
      "start": 640,
      "end": 644.92,
      "text": " Of course you probably noticed that up until now I've been using a term \"old\" nick."
    },
    {
      "start": 644.92,
      "end": 649.8,
      "text": " Because at some point Nick Riccada of yesterday changed into the necrocada of today."
    },
    {
      "start": 649.8,
      "end": 652.12,
      "text": " Many speculate on when the change happened."
    },
    {
      "start": 650,
      "end": 652.12,
      "text": " speculate on when the change happened."
    },
    {
      "start": 652.12,
      "end": 655.36,
      "text": " When did we switch from the volcano law to locate a law she put in?"
    },
    {
      "start": 655.36,
      "end": 659.8,
      "text": " I personally believe, as to many others, it was when he came back from a vacation after"
    },
    {
      "start": 659.8,
      "end": 661,
      "text": " the John Yiddep trial."
    },
    {
      "start": 661,
      "end": 664.48,
      "text": " It was clear to something about that trial, combined with unknown going down in his"
    },
    {
      "start": 664.48,
      "end": 666.92,
      "text": " personal life, really did a number on him."
    },
    {
      "start": 666.92,
      "end": 667.92,
      "text": " It drained him."
    },
    {
      "start": 667.92,
      "end": 670.6,
      "text": " So he went on a much deserved, much notification."
    },
    {
      "start": 670.6,
      "end": 673.12,
      "text": " When he came back, he did it seem different."
    },
    {
      "start": 673.12,
      "end": 677.4,
      "text": " I thought it was a good difference in fact, but slowly but surely everyone began to"
    },
    {
      "start": 675,
      "end": 680.6,
      "text": " But slowly but surely everyone began to hear the changes not only in the shows but to Nick."
    },
    {
      "start": 680.6,
      "end": 683.72,
      "text": " Certain moral principles he held onto he no longer believed in."
    },
    {
      "start": 683.72,
      "end": 687.72,
      "text": " I think the most prominent example is when in the past he would say that he should never"
    },
    {
      "start": 687.72,
      "end": 689.64,
      "text": " post any new zanir internet."
    },
    {
      "start": 689.64,
      "end": 692.28,
      "text": " Never show your ankles and chin in the same picture."
    },
    {
      "start": 692.28,
      "end": 696.44,
      "text": " Things along those lines and then he goes and posts a picture with the whiskey bottle in his"
    },
    {
      "start": 696.44,
      "end": 697.44,
      "text": " butt."
    },
    {
      "start": 697.44,
      "end": 701.72,
      "text": " The Johnny Depp stream brought with it a whole host of wine moms, a completely different"
    },
    {
      "start": 700,
      "end": 704.24,
      "text": " moms. A completely different audience than what he was used to. There was a lot of butt"
    },
    {
      "start": 704.24,
      "end": 709,
      "text": " posting and flashing going on on locals that he, a midi man who would have been opposed"
    },
    {
      "start": 709,
      "end": 713.6,
      "text": " to them doing this in the past, but now he encouraged it. And even joined in, along"
    },
    {
      "start": 713.6,
      "end": 718.44,
      "text": " with his wife. No, I'm not going to show Lady Wackett's butt cheeks. A sentence I would"
    },
    {
      "start": 718.44,
      "end": 722.32,
      "text": " never have thought possible at one point. There was also the kid that did in a chat"
    },
    {
      "start": 722.32,
      "end": 727.48,
      "text": " named Mandy, which Rakeda had multiple drunken occasions to talk about how he would totally"
    },
    {
      "start": 775,
      "end": 780.36,
      "text": " years. His discord became a raging dumpster fire, one which I decided to leave before he ended"
    },
    {
      "start": 780.36,
      "end": 786.44,
      "text": " up nooking it, because he had no care or desire to maintain it. The alcoholism became overwhelming,"
    },
    {
      "start": 786.44,
      "end": 791,
      "text": " whereas in the past you catch on rare occasion being so drunk he began to slow his words,"
    },
    {
      "start": 791,
      "end": 795.56,
      "text": " it became the norm on his show. The amounts of broken promises became a running meme."
    },
    {
      "start": 795.56,
      "end": 800.28,
      "text": " I'll bring back the chat dad's stream, I'll bring back the big brain panel, I'll do the 24"
    },
    {
      "start": 800,
      "end": 803.48,
      "text": " 24 hours, I'll do this, I'll do that."
    },
    {
      "start": 803.48,
      "end": 807.4,
      "text": " At this point, the meme became, if Rakeda said he was gonna do something, you know that"
    },
    {
      "start": 807.4,
      "end": 809.28,
      "text": " something was not gonna get done."
    },
    {
      "start": 809.28,
      "end": 814.24,
      "text": " He, the YouTube lawyer, stopped talking about legal topics, and instead began to talk about"
    },
    {
      "start": 814.24,
      "end": 818.36,
      "text": " things that no one in his old audience wanted to hear him talk about, but the new white"
    },
    {
      "start": 818.36,
      "end": 823.72,
      "text": " mom certainly did, he would talk about disturbing sex toys, most infamously deballed though."
    },
    {
      "start": 823.72,
      "end": 828.92,
      "text": " Banging his wife in various ways, including with the ball though, or in a sex swing, and"
    },
    {
      "start": 825,
      "end": 830.6,
      "text": " ways including with the Baldo or in a sex swing and let me be cleared he would seriously"
    },
    {
      "start": 830.6,
      "end": 837.48,
      "text": " just go on and on and on and on and on again about banging his wife if it wasn't about"
    },
    {
      "start": 837.48,
      "end": 843.24,
      "text": " the sex swing or the Baldo or whatever else it would be non-stop relationship advice much of"
    },
    {
      "start": 843.24,
      "end": 848.36,
      "text": " which came off as disconnected boomer talk even the off-the-cuff ramblings that he used to do which"
    },
    {
      "start": 848.36,
      "end": 853.56,
      "text": " I myself loved became less and less interesting until they became more than more boring or even"
    },
    {
      "start": 850,
      "end": 854.4,
      "text": " unless interesting. Until they became more than more boring or even just annoying."
    },
    {
      "start": 854.4,
      "end": 858.56,
      "text": " It was like his quick wits began to fail with each passing night along with his liver."
    },
    {
      "start": 858.56,
      "end": 863.68,
      "text": " Eventually, I found myself questioning why am I listening anymore? Nothing could interest me anymore."
    },
    {
      "start": 863.68,
      "end": 868.72,
      "text": " In fact, it often disgusts me, but I could not forget what he did for me, so I stuck it out for"
    },
    {
      "start": 868.72,
      "end": 873.52,
      "text": " as long as I could. I tried defending Meg, who had began to turn into the very low cow he used to"
    },
    {
      "start": 873.52,
      "end": 878.32,
      "text": " make fun of, but he kept going down the drain. Why I think this happened, a combination of his"
    },
    {
      "start": 875,
      "end": 879.56,
      "text": " down the drain. Why I think this happened? A combination of his poor time management of the"
    },
    {
      "start": 879.56,
      "end": 884.28,
      "text": " Bridget House and Dept Trials that broke him mentally and physically combined with a mind-blowing"
    },
    {
      "start": 884.28,
      "end": 888.92,
      "text": " success he suddenly gained. Along with the Rumble exclusive contracts, dude must have been making"
    },
    {
      "start": 888.92,
      "end": 894.04,
      "text": " seven figures at this point, but because of all this, he became apathetic, pathologic,"
    },
    {
      "start": 894.04,
      "end": 897.88,
      "text": " and overall corrupted. I went from listening to every show he did."
    },
    {
      "start": 897.88,
      "end": 901.88,
      "text": " Janelle maybe one or two a week if it looked like he was actually going to talk about something"
    },
    {
      "start": 900,
      "end": 904.08,
      "text": " if it looked like he was actually going to talk about something log related or cultural related."
    },
    {
      "start": 904.08,
      "end": 908.32,
      "text": " I still did the coupon codes, but while it was still a good amount coming in, the amount"
    },
    {
      "start": 908.32,
      "end": 911.2,
      "text": " I was getting was notably less with each passing month."
    },
    {
      "start": 911.2,
      "end": 915.6,
      "text": " And so he continued to alienate and even insult his previous fanbase, which included a lot"
    },
    {
      "start": 915.6,
      "end": 919.68,
      "text": " of anime weeps, because the big trout was one of their three major events of the channel"
    },
    {
      "start": 919.68,
      "end": 921.28,
      "text": " that helped blow him up."
    },
    {
      "start": 921.28,
      "end": 925.72,
      "text": " Channels like legal vices or stuff the alternate that were about 20% of his size at the time"
    },
    {
      "start": 925.72,
      "end": 927.48,
      "text": " were bringing in more numbers."
    },
    {
      "start": 950,
      "end": 951,
      "text": " I don't know."
    },
    {
      "start": 951,
      "end": 953,
      "text": " Wait, are they talking about a specific thing?"
    },
    {
      "start": 953,
      "end": 957.36,
      "text": " I don't know, apparently, apparently you're having sex with a bunch of married women."
    },
    {
      "start": 957.36,
      "end": 959.32,
      "text": " Oh yeah, so, um..."
    },
    {
      "start": 959.32,
      "end": 962.12,
      "text": " Head to V-Tuber, Pipkin Pippa on his show."
    },
    {
      "start": 962.12,
      "end": 965.36,
      "text": " Someone Nick previously wanted on a show, but her boss said no."
    },
    {
      "start": 965.36,
      "end": 967.4,
      "text": " Many people to cry, such as choice initially."
    },
    {
      "start": 967.4,
      "end": 971.28,
      "text": " Old Nick and Pipkin Pippa would have made for an amazing show, but now we understand"
    },
    {
      "start": 971.28,
      "end": 972.6,
      "text": " that a little bit better."
    },
    {
      "start": 972.6,
      "end": 976.4,
      "text": " Anyway, Koomla Lot is one of those people who would do anything for the good rift."
    },
    {
      "start": 975,
      "end": 979.68,
      "text": " anything for the good rift. He will tell you that totally ironic but not ironic tone of"
    },
    {
      "start": 979.68,
      "end": 985.68,
      "text": " voice that that side of YouTube always does that everything is just purely for the money."
    },
    {
      "start": 985.68,
      "end": 990.04,
      "text": " Nothing else matters. V2 was bringing a lot of views and cash, so after the interview"
    },
    {
      "start": 990.04,
      "end": 993.72,
      "text": " he had to run to deal with what he could to keep getting her attention. Finally, he did"
    },
    {
      "start": 993.72,
      "end": 997.92,
      "text": " something across the line. He posted a pic of someone else claiming it was Pippa and she"
    },
    {
      "start": 997.92,
      "end": 1003.32,
      "text": " was over at his house for many reasons. Even joking about exposing a V2's identity is"
    },
    {
      "start": 1000,
      "end": 1006.8,
      "text": " Even joking about exposing a VTU's identity is strictly taboo, more so than any other industry I found."
    },
    {
      "start": 1006.8,
      "end": 1011.4,
      "text": " It would have been all well and good if Kuma allowed to apologize like a normal person, but there's no griften death."
    },
    {
      "start": 1011.4,
      "end": 1014.5,
      "text": " So he insulted her entire company in a fake apology."
    },
    {
      "start": 1014.5,
      "end": 1017.9,
      "text": " Rakeet had some not nice things to say as well on a livestream."
    },
    {
      "start": 1017.9,
      "end": 1021,
      "text": " I am any other than I'd like what he had to say, but whatever."
    },
    {
      "start": 1021,
      "end": 1022.6,
      "text": " The manless team like it was done."
    },
    {
      "start": 1022.6,
      "end": 1027,
      "text": " On a Friday night, I can't remember if it was the same week as the Kuma lot Pippa event,"
    },
    {
      "start": 1025,
      "end": 1029.24,
      "text": " same week as the Kumblaut Pippa event, or if it was the next week, but sometime had"
    },
    {
      "start": 1029.24,
      "end": 1030.64,
      "text": " passed since then."
    },
    {
      "start": 1030.64,
      "end": 1035.28,
      "text": " Not one, but two massive impactful Supreme Court rulings dropped on that day."
    },
    {
      "start": 1035.28,
      "end": 1038.64,
      "text": " I wanted to know more about what were the ramifications of these events."
    },
    {
      "start": 1038.64,
      "end": 1040.08,
      "text": " Nick had a show on that night."
    },
    {
      "start": 1040.08,
      "end": 1042.2,
      "text": " The title of the show was about the rulings."
    },
    {
      "start": 1042.2,
      "end": 1044.84,
      "text": " He listed some other lawyers that will be on to talk about it."
    },
    {
      "start": 1044.84,
      "end": 1046.36,
      "text": " I was happy and excited."
    },
    {
      "start": 1046.36,
      "end": 1048.72,
      "text": " This is what made me fall in love with Nick's dreams."
    },
    {
      "start": 1048.72,
      "end": 1052.52,
      "text": " Next morning, I put the show on and to my surprise, Kumblaut is on."
    },
    {
      "start": 1050,
      "end": 1055.84,
      "text": " and to my surprise, Kuma lot is on. For over an hour, with the other disinterested lawyers"
    },
    {
      "start": 1055.84,
      "end": 1062.48,
      "text": " no less, Rakeda and Kuma lot to talk non-stalk about Pippa, Phase Connect, and V2 is as a whole,"
    },
    {
      "start": 1062.48,
      "end": 1067.44,
      "text": " including the fanbase. They would insulting and degrading the entire time. Nick does something"
    },
    {
      "start": 1067.44,
      "end": 1071.6,
      "text": " he's become infamous for at this point. He says talking about his butts about things he does"
    },
    {
      "start": 1071.6,
      "end": 1077.04,
      "text": " not know anything about, like V2 with contracts and companies, and all the behind-the-scenes dealings,"
    },
    {
      "start": 1075,
      "end": 1079.48,
      "text": " and all the behind-the-scenes dealings, but he pretends that he's been expert on it."
    },
    {
      "start": 1079.48,
      "end": 1084.42,
      "text": " Finally, after an hour to insults, someone tries to get the topic onto the between-cold"
    },
    {
      "start": 1084.42,
      "end": 1085.42,
      "text": " drawings."
    },
    {
      "start": 1085.42,
      "end": 1089.02,
      "text": " Nick barely over half a sentence on them, and moves on."
    },
    {
      "start": 1089.02,
      "end": 1090.02,
      "text": " That's it."
    },
    {
      "start": 1090.02,
      "end": 1093.62,
      "text": " Two landmark decisions, and he instead decides to do the thing."
    },
    {
      "start": 1093.62,
      "end": 1097.8,
      "text": " He totally hates doing guys, and the thing he somehow always wrapped up in, even though"
    },
    {
      "start": 1097.8,
      "end": 1099.9,
      "text": " he tries to also her to avoid drama."
    },
    {
      "start": 1099.9,
      "end": 1103.46,
      "text": " It wasn't like he was just making some funny jabs at the beat-u-warts."
    },
    {
      "start": 1100,
      "end": 1103.48,
      "text": " It wasn't like he was just making some funny jabs at the B2 Earth."
    },
    {
      "start": 1103.48,
      "end": 1105.48,
      "text": " I mean he was really digging into the community."
    },
    {
      "start": 1105.48,
      "end": 1108.64,
      "text": " To that point on, I decided that's it."
    },
    {
      "start": 1108.64,
      "end": 1114.04,
      "text": " The ramp at alcoholism, the constant nonstop discomforting sex talk, the insults."
    },
    {
      "start": 1114.04,
      "end": 1118.04,
      "text": " This was not the same man a two years ago, little on four, not by a long shot."
    },
    {
      "start": 1118.04,
      "end": 1124,
      "text": " I decided to quietly cut my ties, no longer support, no longer do coupon codes."
    },
    {
      "start": 1124,
      "end": 1125.6,
      "text": " Let's make no mistake."
    },
    {
      "start": 1125.6,
      "end": 1129.28,
      "text": " Even though his sales were drying up to less than half of what they once were, that was"
    },
    {
      "start": 1125,
      "end": 1129.28,
      "text": " Even though his sales were drying up to less than half of what they once were, that was"
    },
    {
      "start": 1129.28,
      "end": 1133.84,
      "text": " still tens of thousands of dollars every year that I had just walked away from."
    },
    {
      "start": 1133.84,
      "end": 1137.6,
      "text": " At this point in 2023, things should have crashed in economy."
    },
    {
      "start": 1137.6,
      "end": 1142.88,
      "text": " My income was already down by almost 50% compared to the start of the year."
    },
    {
      "start": 1142.88,
      "end": 1148.44,
      "text": " So me walking away from all that money on a modal imprinsible stance financially it hurt."
    },
    {
      "start": 1148.44,
      "end": 1152.16,
      "text": " If you want to help me ease that pain a little bit, check out the website I keep going"
    },
    {
      "start": 1152.16,
      "end": 1153.16,
      "text": " on about."
    },
    {
      "start": 1150,
      "end": 1152.82,
      "text": " a little bit, check out the website I keep going on about."
    },
    {
      "start": 1152.82,
      "end": 1154.94,
      "text": " The dragon's treasure is linked down below."
    },
    {
      "start": 1154.94,
      "end": 1159.24,
      "text": " If you support someone who chose principles over money in a time when he really needed"
    },
    {
      "start": 1159.24,
      "end": 1163.32,
      "text": " that money, let me see it, cause boy do I feel all that loss of revenue."
    },
    {
      "start": 1163.32,
      "end": 1168.08,
      "text": " Over 100 T's, we all shaft coffee, and now soaps, handmade by yours truly."
    },
    {
      "start": 1168.08,
      "end": 1171.9,
      "text": " Unlike the aforementioned people, I'm not gonna call this a grift, because I actually"
    },
    {
      "start": 1171.9,
      "end": 1173.34,
      "text": " do love what I do."
    },
    {
      "start": 1173.34,
      "end": 1175.98,
      "text": " I don't have contempt for my code audience."
    },
    {
      "start": 1175.98,
      "end": 1178.62,
      "text": " If I had a billion dollars, I would not retire."
    },
    {
      "start": 1175,
      "end": 1182,
      "text": " I would still want you to run this company and the spirit of what I'm doing is more important"
    },
    {
      "start": 1182,
      "end": 1185,
      "text": " than the money, as I painfully showcased last summer."
    },
    {
      "start": 1185,
      "end": 1189,
      "text": " So buy some teacher help support me and get me through this economy and let's get back to the plot,"
    },
    {
      "start": 1189,
      "end": 1191,
      "text": " what I will return with making actual edits."
    },
    {
      "start": 1191,
      "end": 1193,
      "text": " Have things gotten better with Nick?"
    },
    {
      "start": 1193,
      "end": 1194,
      "text": " God no."
    },
    {
      "start": 1194,
      "end": 1199,
      "text": " I haven't been hate watching Nick as some of his former fans have, but clips would occasionally come by my timeline."
    },
    {
      "start": 1199,
      "end": 1201,
      "text": " Would people would send me things?"
    },
    {
      "start": 1200,
      "end": 1204.08,
      "text": " my timeline. Would people would send me things? Had one point I actually had to tell somebody"
    },
    {
      "start": 1204.08,
      "end": 1208.64,
      "text": " stopped sending me these things. So again I'm almost done a daily basis. He has continued"
    },
    {
      "start": 1208.64,
      "end": 1216.48,
      "text": " alien age not only his fans but former friends. They're very few YouTubers out there and I will still"
    },
    {
      "start": 1216.48,
      "end": 1223.12,
      "text": " talk to. I know people are like no one associates are Kata. Giants I stopped associated with so"
    },
    {
      "start": 1223.12,
      "end": 1229.28,
      "text": " many people and why? Because they're dishonest. He became low cow of the year in 2023 on"
    },
    {
      "start": 1225,
      "end": 1226.6,
      "text": " 'cause they're dishonest."
    },
    {
      "start": 1226.6,
      "end": 1230.12,
      "text": " He became low cow of the year in 2023 on Keywood Farms"
    },
    {
      "start": 1230.12,
      "end": 1231.6,
      "text": " because of the Star Wars Bible."
    },
    {
      "start": 1231.6,
      "end": 1234.28,
      "text": " He decided to team up with people like Juju the cow,"
    },
    {
      "start": 1234.28,
      "end": 1236.56,
      "text": " also known as Dick Masterson, and Bido,"
    },
    {
      "start": 1236.56,
      "end": 1238.84,
      "text": " a man who was going to uncomfortable lengths"
    },
    {
      "start": 1238.84,
      "end": 1240.36,
      "text": " defending the movie Cuties,"
    },
    {
      "start": 1240.36,
      "end": 1243.48,
      "text": " and befitting to those who go after children as we."
    },
    {
      "start": 1243.48,
      "end": 1246.2,
      "text": " These men proved that you don't need talent, skill,"
    },
    {
      "start": 1246.2,
      "end": 1247.6,
      "text": " or it looks to be successful."
    },
    {
      "start": 1247.6,
      "end": 1250.76,
      "text": " Just hate, fart, and domicart, and pay pigs will follow."
    },
    {
      "start": 1250.76,
      "end": 1252.28,
      "text": " He's gone after the YouTube when a comic"
    },
    {
      "start": 1252.28,
      "end": 1254.52,
      "text": " would create an adochilite repeatedly."
    },
    {
      "start": 1250,
      "end": 1255.44,
      "text": " follow. He's gone after YouTube when a comic book created an adochil I repeatedly, non-stop,"
    },
    {
      "start": 1255.44,
      "end": 1261.04,
      "text": " in many drunken bands. Over essentially nothing. I've never given a dime to Eric, so I don't"
    },
    {
      "start": 1261.04,
      "end": 1266.24,
      "text": " really have a reason to be on his side, but the amount Nick, Juju and Vito have gone after this man's"
    },
    {
      "start": 1266.24,
      "end": 1271.2,
      "text": " business is astounding and is enough to piss off anybody at this point. The way we became"
    },
    {
      "start": 1271.2,
      "end": 1275.6,
      "text": " and decided to start defending the movie cuties, I covered this yesterday on my livestream,"
    },
    {
      "start": 1275,
      "end": 1281.8,
      "text": " live stream and we watch the trailer and I determined that basically everyone"
    },
    {
      "start": 1281.8,
      "end": 1286.64,
      "text": " involved should get the gas. Like you said, there could be a daring and brave"
    },
    {
      "start": 1286.64,
      "end": 1291.68,
      "text": " decision to do something and it can still be unacceptable and it can still be"
    },
    {
      "start": 1291.68,
      "end": 1298.2,
      "text": " exploitative and it can still put children at risk and one of the key reasons"
    },
    {
      "start": 1298.2,
      "end": 1304.12,
      "text": " that child porn is banned is not just the damage done to the children who's a"
    },
    {
      "start": 1300,
      "end": 1303.2,
      "text": " is banned is not just the damage done"
    },
    {
      "start": 1303.2,
      "end": 1306.6,
      "text": " to the children who's a victim of the particular photography."
    },
    {
      "start": 1306.6,
      "end": 1309.36,
      "text": " It's the idea that creating the market"
    },
    {
      "start": 1309.36,
      "end": 1312.88,
      "text": " around the exploited children exposes more children"
    },
    {
      "start": 1312.88,
      "end": 1316.52,
      "text": " to exploitation and children are particularly vulnerable"
    },
    {
      "start": 1316.52,
      "end": 1318.4,
      "text": " and unable to protect themselves."
    },
    {
      "start": 1318.4,
      "end": 1319.92,
      "text": " A lot of people should on veto"
    },
    {
      "start": 1319.92,
      "end": 1322.92,
      "text": " for his staunch defense of cuties also."
    },
    {
      "start": 1350,
      "end": 1353.52,
      "text": " The right-through thing is weird, but I guess I need to see the context."
    },
    {
      "start": 1353.52,
      "end": 1362.2,
      "text": " Rakeda has finally, with no more bridge left with me, being left on red, has gone through"
    },
    {
      "start": 1362.2,
      "end": 1368.6,
      "text": " and finally committed to the stick, and he is now firmly on team, Juju the cow, team"
    },
    {
      "start": 1368.6,
      "end": 1375.48,
      "text": " Christopher goes all to the pedophile, and he's now defending cuties as an artistic expression,"
    },
    {
      "start": 1375,
      "end": 1380.5,
      "text": " Predesizing the sexual exploitation of children by sexually exploiting children."
    },
    {
      "start": 1380.5,
      "end": 1388.5,
      "text": " By having crotch shots on 11 year olds in Leotards, they are making a point about Hollywood or some shit."
    },
    {
      "start": 1388.5,
      "end": 1395.6,
      "text": " An even grave desecration, but for the signs of his decline, this video's length is already much longer than 9/10 of it to be."
    },
    {
      "start": 1395.6,
      "end": 1397.5,
      "text": " I was going to go into even more detail."
    },
    {
      "start": 1397.5,
      "end": 1404.9,
      "text": " Show more videos about drunken Nick, showcasing more hypocrisy, talking about specific events, like how he drunkenly attacked the trust of a man."
    },
    {
      "start": 1400,
      "end": 1404.8,
      "text": " hypocrisy. Talking about specific events like how he drunkenly attacked the trust of a man"
    },
    {
      "start": 1404.8,
      "end": 1409.36,
      "text": " who reached out to him because he wanted to off himself but many videos have been done on this"
    },
    {
      "start": 1409.36,
      "end": 1415.84,
      "text": " already. In the point of all this, believe it or not, is not to bash Nick. What sparked this is what"
    },
    {
      "start": 1415.84,
      "end": 1420.64,
      "text": " happened on his stream on Tuesday, May 20th, where Nick became... whatever this is."
    },
    {
      "start": 1422.72,
      "end": 1424.72,
      "text": " Why would you do this? Why now?"
    },
    {
      "start": 1475,
      "end": 1479.56,
      "text": " down about you probably doesn't mean anything so maybe hitting it from someone who owes"
    },
    {
      "start": 1479.56,
      "end": 1485.56,
      "text": " so much to you? Well you need help. You are not in a good space at all. You are an alcoholic"
    },
    {
      "start": 1485.56,
      "end": 1489.96,
      "text": " and a bad one at that. I don't know what you're taking but you're taking some kind of a drug."
    },
    {
      "start": 1489.96,
      "end": 1494.28,
      "text": " I heard about how you decided to take January off from drinking but you decided to change that"
    },
    {
      "start": 1494.28,
      "end": 1498.84,
      "text": " until you'll take January off from drinking on stream. I don't even know if you hold on to even that."
    },
    {
      "start": 1498.84,
      "end": 1503.08,
      "text": " You are missing what shows that you're making which I am sure it goes against your contract."
    },
    {
      "start": 1500,
      "end": 1503,
      "text": " than you're making, which I am sure it goes against your contract."
    },
    {
      "start": 1503,
      "end": 1507.76,
      "text": " You're weird over the top lies, like your 107 degree temperature or whatever you claim"
    },
    {
      "start": 1507.76,
      "end": 1512.04,
      "text": " to have, but getting worse and worse, I don't know what else it will take for you to"
    },
    {
      "start": 1512.04,
      "end": 1516.44,
      "text": " realize this, but you more than likely do need to go to rehab."
    },
    {
      "start": 1516.44,
      "end": 1520.12,
      "text": " And afterwards, you're going to have to make a lot of apologies to a lot of people."
    },
    {
      "start": 1520.12,
      "end": 1525.76,
      "text": " No, not any woke mob, and not to people who only want to see your downfall, your friends,"
    },
    {
      "start": 1525.76,
      "end": 1528.36,
      "text": " your family, your audience."
    },
    {
      "start": 1525,
      "end": 1531.44,
      "text": " your family, your audience. The ones who still cared about you. I want you to once again"
    },
    {
      "start": 1531.44,
      "end": 1536.04,
      "text": " be a man I could happily say that I support. Not someone that I have to apologize and"
    },
    {
      "start": 1536.04,
      "end": 1540.4,
      "text": " make excuses for that I used to support. You were a good family man and even though I'm"
    },
    {
      "start": 1540.4,
      "end": 1544.5,
      "text": " not a Christian I still abuse you as one of the best examples of a man with a strong"
    },
    {
      "start": 1544.5,
      "end": 1548.32,
      "text": " Christian base. This is not the style of content I normally make."
    },
    {
      "start": 1548.32,
      "end": 1552.42,
      "text": " If you expect one of these drama videos there's no point in subscribing. To any"
    },
    {
      "start": 1550,
      "end": 1552.12,
      "text": " There's no point in subscribing."
    },
    {
      "start": 1552.12,
      "end": 1556.72,
      "text": " To any former fan to find me after so much time, well, hello I guess."
    },
    {
      "start": 1556.72,
      "end": 1559.96,
      "text": " Check out the links in some of my videos to see if the content I normally make is something"
    },
    {
      "start": 1559.96,
      "end": 1560.96,
      "text": " up at the alley."
    },
    {
      "start": 1560.96,
      "end": 1562.56,
      "text": " And once again, to Nick."
    },
    {
      "start": 1562.56,
      "end": 1567.64,
      "text": " Find some help or at some point you will cross a line in which no apology will work on"
    },
    {
      "start": 1567.64,
      "end": 1568.64,
      "text": " anyone else again."
    }
  ]
}